<template>
  <div class="main">
    <h2>Как мы работаем</h2>
    <p>
      Мы строим горизонтальную компанию — без начальников и подчинённых.
      Над проектами компании работают небольшие команды из 7-10 человек.
      У команд есть руководители, задача которых — помогать словом и делом.
      Работать с высоконагруженными проектами — большая ответственность.
      Но этот крутой опыт в Казахстане можно получить только у нас.
      Два раза в год мы открываем Колёса.Академию — оплачиваемую трёхмесячную
      стажировку для студентов.По её оконачии стажёры получают предложения о работе
      — у нас или в компаниях-партнёрах.Мы регулярно выступаем на конференциях и
      мастер-классах и посещаем их сами. Компания оплачивает участие сотрудников
      в обучающих программах в Казахстане и зарубежом. Единственное условие
      — по возвращении домой поделиться полученными знаниями с командой.Мы устроили
      наш офис так, чтобы в нём было комфортно работать. Здесь почти нет стен и кабинетов,
      зато есть пуфы, настольный теннис, библиотека, столовая и даже две ванные комнаты.
    </p>
    <div class="img-box">
      <img src="@/assets/img/team1.jpg" alt="Team1">
      <img src="@/assets/img/team2.jpg" alt="Team2">
      <img src="@/assets/img/team3.jpg" alt="Team3">
      <img src="@/assets/img/team4.jpg" alt="Team4">
    </div>
  </div>
</template>

<style lang="scss" scoped>
  p {
    margin-top: 20px;
  }
  .img-box{
  margin: 20px auto;
  width:600px;
  height:600px;
  display:grid;
  grid-template-columns: 300px 300px;
  grid-row: auto auto;
  gap: 20px;

    & img {
      width: 100%;
      border-radius:10px;

      &:hover {
        transform: scale(1.2);
        transition: all 0.2s ease;
      }
    }
  }
</style>
